## Collaborative Filtering

### Preprocessing

In [1]:
import pandas as pd
#Math functions, we'll only need the sqrt function so let's import only that
from math import sqrt
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
#Storing the movie information into a pandas dataframe
movies_df = pd.read_csv('movies.csv')
#Storing the user information into a pandas dataframe
ratings_df = pd.read_csv('ratings.csv')

In [3]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
#Using regular expressions to find a year stored between parentheses
#We specify the parantheses so we don't conflict with movies that have years in their titles
movies_df['year'] = movies_df.title.str.extract('(\(\d\d\d\d\))',expand=False)
#Removing the parentheses
movies_df['year'] = movies_df.year.str.extract('(\d\d\d\d)',expand=False)
#Removing the years from the 'title' column
movies_df['title'] = movies_df.title.str.replace('(\(\d\d\d\d\))', '')
#Applying the strip function to get rid of any ending whitespace characters that may have appeared
movies_df['title'] = movies_df['title'].apply(lambda x: x.strip())

In [5]:
movies_df.head()

,movieId,title,genres,year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995

In [6]:
#Dropping the genres column
movies_df = movies_df.drop('genres', 1)

In [10]:
movies_df.head()

   movieId                        title  year
0        1                    Toy Story  1995
1        2                      Jumanji  1995
2        3             Grumpier Old Men  1995
3        4            Waiting to Exhale  1995
4        5  Father of the Bride Part II  1995

In [7]:
ratings_df.head()

   userId  movieId  rating   timestamp
0       1      169     2.5  1204927694
1       1     2471     3.0  1204927438
2       1    48516     5.0  1204927435
3       2     2571     3.5  1436165433
4       2   109487     4.0  1436165496

In [8]:
#Drop removes a specified row or column from a dataframe
ratings_df = ratings_df.drop('timestamp', 1)

In [9]:
ratings_df.head()

   userId  movieId  rating
0       1      169     2.5
1       1     2471     3.0
2       1    48516     5.0
3       2     2571     3.5
4       2   109487     4.0

### Collaborative Filtering

#### Collaborative Filtering,  also known as User-User Filtering. Uses other users to recommend items to the input user. It attempts to find users that have similar preferences and opinions as the input and then recommends items that they have liked to the input. 寻找与目标顾客相似的，将相似顾客喜欢的电影推荐给目标顾客。寻找相似顾客的方法此处用Pearson Correlation Function

#### step 1. create an input user to recommend movies to

In [11]:
userInput = [
            {'title':'Breakfast Club, The', 'rating':5},
            {'title':'Toy Story', 'rating':3.5},
            {'title':'Jumanji', 'rating':2},
            {'title':"Pulp Fiction", 'rating':5},
            {'title':'Akira', 'rating':4.5}
         ] 
inputMovies = pd.DataFrame(userInput)
inputMovies

                 title  rating
0  Breakfast Club, The     5.0
1            Toy Story     3.5
2              Jumanji     2.0
3         Pulp Fiction     5.0
4                Akira     4.5

In [15]:
## Add movieId to input user
inputID = movies_df[movies_df['title'].isin(inputMovies['title'].tolist())]
inputMovies = pd.merge(inputID,inputMovies)
inputMovies = inputMovies.drop('year',1)
inputMovies

   movieId                title  rating
0        1            Toy Story     3.5
1        2              Jumanji     2.0
2      296         Pulp Fiction     5.0
3     1274                Akira     4.5
4     1968  Breakfast Club, The     5.0

#### step 2. By movieId, find users who has seen the same movies

In [16]:
#Filtering out users that have watched movies that the input has watched and storing it
userSubset = ratings_df[ratings_df['movieId'].isin(inputMovies['movieId'].tolist())]
userSubset.head()

     userId  movieId  rating
19        4      296     4.0
441      12     1968     3.0
479      13        2     2.0
531      13     1274     5.0
681      14      296     2.0

In [17]:
#Groupby creates several sub dataframes where they all have the same value in the column specified as the parameter
userSubsetGroup = userSubset.groupby(['userId'])

In [18]:
# check one group
userSubsetGroup.get_group(1130)

        userId  movieId  rating
104167    1130        1     0.5
104168    1130        2     4.0
104214    1130      296     4.0
104363    1130     1274     4.5
104443    1130     1968     4.5

In [19]:
#Sorting it so users with movie most in common with the input will have priority
userSubsetGroup = sorted(userSubsetGroup,  key=lambda x: len(x[1]), reverse=True)

In [20]:
userSubsetGroup[0:3]

[(75,
        userId  movieId  rating
  7507      75        1     5.0
  7508      75        2     3.5
  7540      75      296     5.0
  7633      75     1274     4.5
  7673      75     1968     5.0),
 (106,
        userId  movieId  rating
  9083     106        1     2.5
  9084     106        2     3.0
  9115     106      296     3.5
  9198     106     1274     3.0
  9238     106     1968     3.5),
 (686,
         userId  movieId  rating
  61336     686        1     4.0
  61337     686        2     3.0
  61377     686      296     4.0
  61478     686     1274     4.0
  61569     686     1968     5.0)]

#### step 3. calculate similarity of users to input user (Pearson Correlation Coefficient)

#### the values given by the formula vary from r = -1 to r = 1, where 1 forms a direct correlation between the two entities (it means a perfect positive correlation) and -1 forms a perfect negative correlation.

In [21]:
# use a group of the users to iterate
userSubsetGroup = userSubsetGroup[0:100]

#Store the Pearson Correlation in a dictionary, where the key is the user Id and the value is the coefficient
pearsonCorrelationDict = {}

#For every user group in our subset
for name, group in userSubsetGroup:
    #Let's start by sorting the input and current user group so the values aren't mixed up later on
    group = group.sort_values(by='movieId')
    inputMovies = inputMovies.sort_values(by='movieId')
    #Get the N for the formula
    nRatings = len(group)
    #Get the review scores for the movies that they both have in common
    temp_df = inputMovies[inputMovies['movieId'].isin(group['movieId'].tolist())]
    #And then store them in a temporary buffer variable in a list format to facilitate future calculations
    tempRatingList = temp_df['rating'].tolist()
    #Let's also put the current user group reviews in a list format
    tempGroupList = group['rating'].tolist()
    #Now let's calculate the pearson correlation between two users, so called, x and y
    Sxx = sum([i**2 for i in tempRatingList]) - pow(sum(tempRatingList),2)/float(nRatings)
    Syy = sum([i**2 for i in tempGroupList]) - pow(sum(tempGroupList),2)/float(nRatings)
    Sxy = sum( i*j for i, j in zip(tempRatingList, tempGroupList)) - sum(tempRatingList)*sum(tempGroupList)/float(nRatings)
    
    #If the denominator is different than zero, then divide, else, 0 correlation.
    if Sxx != 0 and Syy != 0:
        pearsonCorrelationDict[name] = Sxy/sqrt(Sxx*Syy)
    else:
        pearsonCorrelationDict[name] = 0

In [22]:
pearsonCorrelationDict.items()

dict_items([(75, 0.8272781516947562), (106, 0.5860090386731182), (686, 0.8320502943378437), (815, 0.5765566601970551), (1040, 0.9434563530497265), (1130, 0.2891574659831201), (1502, 0.8770580193070299), (1599, 0.4385290096535153), (1625, 0.716114874039432), (1950, 0.179028718509858), (2065, 0.4385290096535153), (2128, 0.5860090386731196), (2432, 0.1386750490563073), (2791, 0.8770580193070299), (2839, 0.8204126541423674), (2948, -0.11720180773462392), (3025, 0.45124262819713973), (3040, 0.89514359254929), (3186, 0.6784622064861935), (3271, 0.26989594817970664), (3429, 0.0), (3734, -0.15041420939904673), (4099, 0.05860090386731196), (4208, 0.29417420270727607), (4282, -0.4385290096535115), (4292, 0.6564386345361464), (17, -0.3458572319330373), (114, 0.6363636363636364), (122, 0.24902912254587614), (217, 0.8819171036881969), (222, 0), (241, -0.3799802978286742), (277, 0.8703882797784892), (340, 0.8703882797784892), (373, 0.723746864455746), (393, 0.592156525463792), (407, 0.6446583712203042), (432, 0.8528028654224418), (447, 0.5222329678670935), (461, 0.7385489458759964), (479, -0.8007572173962101), (534, 0.8553372034476997), (558, 0.899228803025897), (584, -0.09090909090909091), (599, 0.9869275424396534), (627, 0.7856742013183862), (670, 0.30151134457776363), (784, 0.9655810287305759), (899, 0.8866206949335731), (904, 0.8181818181818182), (927, 0.6625413488689132), (938, -0.4573295603800236), (974, -0.9428090415820635), (1066, 0.9650595721775965), (1107, 0.9198662110077999), (1152, 0.4923659639173309), (1200, 0.9438798074485389), (1204, 0.30151134457776363), (1255, 1.0), (1414, 0.90694099390581), (1519, 0.9710607611177229), (1607, -0.6363636363636364), (1629, 0.8058229640253802), (1643, 0.6288082227054205), (1667, -0.6377928041432807), (1785, 0.764093177458341), (1824, 0.8017837257372732), (1848, -0.6363636363636364), (1895, -0.1873171623163388), (1966, 0.8819171036881969), (2106, 0.4923659639173309), (2108, 0.7526178090063816), (2115, 0.5222329678670935), (2120, 0.6288082227054205), (2130, 0.9045340337332908), (2204, 0.6363636363636364), (2214, -0.27701734442577747), (2278, 0.899954085146515), (2328, 0.0), (2397, 0.5222329678670935), (2404, 0.4788611546444422), (2473, 0.7237468644557459), (2596, 0.8528028654224418), (2625, -0.45454545454545453), (2711, 0.9438798074485389), (2726, 0.7715167498104595), (2741, -0.3133397807202561), (2795, 0.7385489458759964), (2942, 0.47140452079103173), (2945, -0.7385489458759964), (2964, 0.8528028654224418), (2982, 0.899228803025897), (2999, 0.8476290894688449), (3013, 0.47140452079103173), (3051, 0.9341484842923421), (3089, -0.5222329678670935), (3116, 0.7122123116119197), (3127, 0.0657951694959769), (3176, 0.6363636363636364), (3281, 0.8866206949335731)])

In [23]:
pearsonDF = pd.DataFrame.from_dict(pearsonCorrelationDict, orient='index')
pearsonDF.columns = ['similarityIndex']
pearsonDF['userId'] = pearsonDF.index
pearsonDF.index = range(len(pearsonDF))
pearsonDF.head()

   similarityIndex  userId
0         0.827278      75
1         0.586009     106
2         0.832050     686
3         0.576557     815
4         0.943456    1040

#### step 4. find the top x similar users to input user

In [24]:
topUsers=pearsonDF.sort_values(by='similarityIndex', ascending=False)[0:50] #选前50个最相近的user
topUsers.head()

    similarityIndex  userId
58         1.000000    1255
44         0.986928     599
60         0.971061    1519
47         0.965581     784
53         0.965060    1066

#### step 5. get weighted-rating of selected users to all movies

In [25]:
topUsersRating=topUsers.merge(ratings_df, left_on='userId', right_on='userId', how='inner')
topUsersRating.head()

   similarityIndex  userId  movieId  rating
0              1.0    1255        1     3.0
1              1.0    1255        2     2.5
2              1.0    1255       10     3.5
3              1.0    1255       18     3.5
4              1.0    1255       19     3.5

In [26]:
#Multiplies the similarity by the user's ratings
topUsersRating['weightedRating'] = topUsersRating['similarityIndex']*topUsersRating['rating']
topUsersRating.head()

   similarityIndex  userId  movieId  rating  weightedRating
0              1.0    1255        1     3.0             3.0
1              1.0    1255        2     2.5             2.5
2              1.0    1255       10     3.5             3.5
3              1.0    1255       18     3.5             3.5
4              1.0    1255       19     3.5             3.5

In [27]:
#Applies a sum to the topUsers after grouping it up by userId
tempTopUsersRating = topUsersRating.groupby('movieId').sum()[['similarityIndex','weightedRating']]
tempTopUsersRating.columns = ['sum_similarityIndex','sum_weightedRating']
tempTopUsersRating.head()

         sum_similarityIndex  sum_weightedRating
movieId
1                  41.118954          155.094399
2                  41.097373           99.389823
3                  11.042973           31.326922
4                   2.299245            6.522353
5                  10.619825           29.177956

#### step 6. find top 20 movies to recommend

In [28]:
#Creates an empty dataframe
recommendation_df = pd.DataFrame()
#Now we take the weighted average
recommendation_df['weighted average recommendation score'] = tempTopUsersRating['sum_weightedRating']/tempTopUsersRating['sum_similarityIndex']
recommendation_df['movieId'] = tempTopUsersRating.index
recommendation_df.head()

         weighted average recommendation score  movieId
movieId
1                                     3.771847        1
2                                     2.418398        2
3                                     2.836820        3
4                                     2.836737        4
5                                     2.747499        5

In [29]:
# sort it and see the top 20 movies that the algorithm recommended

recommendation_df = recommendation_df.sort_values(by='weighted average recommendation score', ascending=False)
recommendation_df.head(10)

         weighted average recommendation score  movieId
movieId
7266                                       5.0     7266
3030                                       5.0     3030
5034                                       5.0     5034
3284                                       5.0     3284
97933                                      5.0    97933
2284                                       5.0     2284
4977                                       5.0     4977
7802                                       5.0     7802
60816                                      5.0    60816
60818                                      5.0    60818

In [30]:
movies_df.loc[movies_df['movieId'].isin(recommendation_df.head(10)['movieId'].tolist())]

       movieId                                              title  year
2200      2284                                       Bandit Queen  1994
2944      3030                                            Yojimbo  1961
3198      3284                               They Might Be Giants  1971
4882      4977                       Kandahar (Safar e Ghandehar)  2001
4939      5034                               Truly, Madly, Deeply  1991
7155      7266                      Lost Skeleton of Cadavra, The  2002
7486      7802                                      Warriors, The  1979
12892    60816  Colour of Magic, The (Terry Pratchett's The Co...  2008
12893    60818            Hogfather (Terry Pratchett's Hogfather)  2006
19870    97933                                   5 Broken Cameras  2011